def hamilton(G, pt, path=[]):
    path.append(pt)
    if len(path) == len(G):
        if G[path[-1]][path[0]] == 1:
            print("Гамильтонов цикл: ", path)
        else:
            print("Гамильтонов путь: ", path)
    for pt_next in range(len(graph)):
        if G[pt][pt_next] == 1:
            if pt_next not in path:
                hamilton(G, pt_next, list(path))
    path.pop()

graph = [[0, 1, 1, 1, 0, 0, 0],
         [1, 0, 1, 0, 1, 0, 1],
         [1, 1, 0, 1, 1, 1, 1],
         [1, 0, 1, 0, 1, 1, 1],
         [0, 1, 1, 1, 0, 1, 0],
         [0, 0, 1, 1, 1, 0, 1],
         [0, 1, 1, 1, 0, 1, 0]]

hamilton(graph,0)

graph = [[0, 1, 1, 1, 0, 0, 0],
         [1, 0, 1, 0, 1, 0, 1],
         [1, 1, 0, 1, 0, 1, 1],
         [1, 0, 1, 0, 1, 1, 1],
         [0, 1, 0, 0, 0, 1, 0],
         [0, 0, 1, 1, 0, 0, 1],
         [0, 1, 1, 1, 0, 1, 0]]

graph = [[0, 1, 0],
         [1, 0, 1],
         [1, 0, 0]]

graph = [[0, 1, 1, 1, 0, 0, 0],
         [1, 0, 1, 0, 1, 0, 1],
         [1, 1, 0, 1, 1, 1, 1],
         [1, 0, 1, 0, 1, 1, 1],
         [0, 1, 1, 1, 0, 1, 0],
         [0, 0, 1, 1, 1, 0, 1],
         [0, 1, 1, 1, 0, 1, 0]]